src/Documents/ТабельУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ТабельУчетаРабочегоВремени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РабочееВремяСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДниРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасов</Name>
							<Comment>Всего часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/РабочееВремяСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяСотрудников</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ТабельУчетаРабочегоВремени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс	
	
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаТаблицаРабочееВремяСотрудников(Документ, СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаРабочееВремяСотрудников.СтруктурнаяЕдиница,
	|	ТаблицаРабочееВремяСотрудников.Сотрудник,
	|	ТаблицаРабочееВремяСотрудников.Врач,
	|	ТаблицаРабочееВремяСотрудников.Период,
	|	ТаблицаРабочееВремяСотрудников.Дней,
	|	ТаблицаРабочееВремяСотрудников.Часов
	|ИЗ
	|	ВременнаяТаблицаРабочееВремяСотрудников КАК ТаблицаРабочееВремяСотрудников";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРабочееВремяСотрудников", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(Документ, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТабельУчетаРабочегоВремени.Ссылка.СтруктурнаяЕдиница,
				   |	ТабельУчетаРабочегоВремени.Ссылка.ВидОперации КАК ВидОперации,
	               |	ТабельУчетаРабочегоВремени.Сотрудник,
	               |	ТабельУчетаРабочегоВремени.Ссылка.Ассистент КАК Ассистент,
	               |	ТабельУчетаРабочегоВремени.Ссылка.Период КАК Период,
	               |	ТабельУчетаРабочегоВремени.День1,
	               |	ТабельУчетаРабочегоВремени.День2,
	               |	ТабельУчетаРабочегоВремени.День3,
	               |	ТабельУчетаРабочегоВремени.День4,
	               |	ТабельУчетаРабочегоВремени.День5,
	               |	ТабельУчетаРабочегоВремени.День6,
	               |	ТабельУчетаРабочегоВремени.День7,
	               |	ТабельУчетаРабочегоВремени.День8,
	               |	ТабельУчетаРабочегоВремени.День9,
	               |	ТабельУчетаРабочегоВремени.День10,
	               |	ТабельУчетаРабочегоВремени.День11,
	               |	ТабельУчетаРабочегоВремени.День12,
	               |	ТабельУчетаРабочегоВремени.День13,
	               |	ТабельУчетаРабочегоВремени.День14,
	               |	ТабельУчетаРабочегоВремени.День15,
	               |	ТабельУчетаРабочегоВремени.День16,
	               |	ТабельУчетаРабочегоВремени.День17,
	               |	ТабельУчетаРабочегоВремени.День18,
	               |	ТабельУчетаРабочегоВремени.День19,
	               |	ТабельУчетаРабочегоВремени.День20,
	               |	ТабельУчетаРабочегоВремени.День21,
	               |	ТабельУчетаРабочегоВремени.День22,
	               |	ТабельУчетаРабочегоВремени.День23,
	               |	ТабельУчетаРабочегоВремени.День24,
	               |	ТабельУчетаРабочегоВремени.День25,
	               |	ТабельУчетаРабочегоВремени.День26,
	               |	ТабельУчетаРабочегоВремени.День27,
	               |	ТабельУчетаРабочегоВремени.День28,
	               |	ТабельУчетаРабочегоВремени.День29,
	               |	ТабельУчетаРабочегоВремени.День30,
	               |	ТабельУчетаРабочегоВремени.День31
	               |ИЗ
	               |	Документ.ТабельУчетаРабочегоВремени.ДниРаботы КАК ТабельУчетаРабочегоВремени
	               |ГДЕ
	               |	ТабельУчетаРабочегоВремени.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	ТаблицаДокументаТабеля = Запрос.Выполнить().Выгрузить();
	
	ТаблицаТабеля = РегистрыНакопления.РабочееВремяСотрудников.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Для Каждого СтрокаТЧ Из ТаблицаДокументаТабеля Цикл
		Для а = 1 По 31 Цикл
			Если ЗначениеЗаполнено(СтрокаТЧ["День" + а]) Тогда
				НоваяСтрока = ТаблицаТабеля.Добавить();
				НоваяСтрока.СтруктурнаяЕдиница = СтрокаТЧ.СтруктурнаяЕдиница;		
				Если СтрокаТЧ.ВидОперации = 0 Тогда
					НоваяСтрока.Сотрудник = СтрокаТЧ.Сотрудник;
				Иначе
					НоваяСтрока.Сотрудник = СтрокаТЧ.Ассистент;
					НоваяСтрока.Врач 	  = СтрокаТЧ.Сотрудник;					
				КонецЕсли;
				НоваяСтрока.Период 	  = НачалоМесяца(СтрокаТЧ.Период) + (а - 1) * 24 * 60 * 60;
				НоваяСтрока.Дней 	  = 1;
				НоваяСтрока.Часов     = СтрокаТЧ["День" + а];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	               |	ТабельУчетаРабочегоВремени.СтруктурнаяЕдиница,
	               |	ТабельУчетаРабочегоВремени.Сотрудник,
				   |	ТабельУчетаРабочегоВремени.Врач,
	               |	ТабельУчетаРабочегоВремени.Период,
	               |	ТабельУчетаРабочегоВремени.Дней,
	               |	ТабельУчетаРабочегоВремени.Часов
	               |ПОМЕСТИТЬ ВременнаяТаблицаРабочееВремяСотрудников
	               |ИЗ
	               |	&ТаблицаТабеля КАК ТабельУчетаРабочегоВремени";
	Запрос.УстановитьПараметр("ТаблицаТабеля", ТаблицаТабеля);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаТаблицаРабочееВремяСотрудников(Документ, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Функция получает проведенный документ Табеля, по ключевым параметрам:
//
// Параметры:
// 		Параметры        - Структура параметров, СтруктурнаяЕдиница, Период
// 		Ссылка           - ДокументСсылка, ссылка на существующий документ
// 
// Возвращаемое значение:
// 		Ссылка на найденный документ
//
Функция ВозвратитьДокументПоРеквизитам(Параметры, Ссылка) Экспорт
	       
	// Проверяем есть ли документ с таким месяцем
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабельУчетаРабочегоВремени.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТабельУчетаРабочегоВремени КАК ТабельУчетаРабочегоВремени
		|ГДЕ
		|	ТабельУчетаРабочегоВремени.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ТабельУчетаРабочегоВремени.Период = &Период
		|	И ТабельУчетаРабочегоВремени.Проведен = ИСТИНА
		|	И ТабельУчетаРабочегоВремени.Ссылка <> &Ссылка";
		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Параметры.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Период", Параметры.Период);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатТаблица = Запрос.Выполнить().Выгрузить();
								
	Если РезультатТаблица.Количество() > 0 Тогда
		Возврат РезультатТаблица[0].Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Процедура подготовки печатных форм 
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_Табель";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Табель.Дата КАК ДатаДокумента,
		|	Табель.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	Табель.Период КАК ПериодРегистрации,
		|	Табель.Номер,
		|	Табель.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
		|	Табель.СтруктурнаяЕдиница.Организация.ПолноеНаименование КАК ПолноеНаименование,
		|	Табель.СтруктурнаяЕдиница.Организация КАК Организация
		|ИЗ
		|	Документ.ТабельУчетаРабочегоВремени КАК Табель
		|ГДЕ
		|	Табель.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Табель_Макет";		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТабельУчетаРабочегоВремени.ПФ_MXL_Макет");
		
		ОбластьШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьШапка          = Макет.ПолучитьОбласть("Шапка");
		ОбластьДетали         = Макет.ПолучитьОбласть("Детали");
		ОбластьПодвал         = Макет.ПолучитьОбласть("Подвал");
		
		Если Шапка.ДатаДокумента < Дата('20110101') Тогда
			НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Шапка.Префикс);
		Иначе
			НомерДокумента = ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(Шапка.Номер, Истина, Истина);
		КонецЕсли;		
		
		ОбластьШапкаДокумента.Параметры.ИмяОрганизации   = ?(ЗначениеЗаполнено(Шапка.ПолноеНаименование),Шапка.ПолноеНаименование, Строка(Шапка.Организация));

		ОбластьШапкаДокумента.Параметры.НомерДокумента   = НомерДокумента;
		ОбластьШапкаДокумента.Параметры.ДатаЗаполнения   = Шапка.ДатаДокумента;
		ОбластьШапкаДокумента.Параметры.ДатаНач          = Шапка.ПериодРегистрации;
		ОбластьШапкаДокумента.Параметры.ДатаКон          = КонецМесяца(Шапка.ПериодРегистрации);
		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",   ТекущийДокумент);
		Запрос.УстановитьПараметр("ПериодРегистрации",   Шапка.ПериодРегистрации);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТабельОтработанноеВремяПоДням.Сотрудник,
		|	ТабельОтработанноеВремяПоДням.Должность,
		|	ТабельОтработанноеВремяПоДням.Сотрудник.Код КАК ТабНомер,
		|	ТабельОтработанноеВремяПоДням.День1,
		|	ТабельОтработанноеВремяПоДням.День2,
		|	ТабельОтработанноеВремяПоДням.День3,
		|	ТабельОтработанноеВремяПоДням.День4,
		|	ТабельОтработанноеВремяПоДням.День5,
		|	ТабельОтработанноеВремяПоДням.День6,
		|	ТабельОтработанноеВремяПоДням.День7,
		|	ТабельОтработанноеВремяПоДням.День8,
		|	ТабельОтработанноеВремяПоДням.День9,
		|	ТабельОтработанноеВремяПоДням.День10,
		|	ТабельОтработанноеВремяПоДням.День11,
		|	ТабельОтработанноеВремяПоДням.День12,
		|	ТабельОтработанноеВремяПоДням.День13,
		|	ТабельОтработанноеВремяПоДням.День14,
		|	ТабельОтработанноеВремяПоДням.День15,
		|	ТабельОтработанноеВремяПоДням.День16,
		|	ТабельОтработанноеВремяПоДням.День17,
		|	ТабельОтработанноеВремяПоДням.День18,
		|	ТабельОтработанноеВремяПоДням.День19,
		|	ТабельОтработанноеВремяПоДням.День20,
		|	ТабельОтработанноеВремяПоДням.День21,
		|	ТабельОтработанноеВремяПоДням.День22,
		|	ТабельОтработанноеВремяПоДням.День23,
		|	ТабельОтработанноеВремяПоДням.День24,
		|	ТабельОтработанноеВремяПоДням.День25,
		|	ТабельОтработанноеВремяПоДням.День26,
		|	ТабельОтработанноеВремяПоДням.День27,
		|	ТабельОтработанноеВремяПоДням.День28,
		|	ТабельОтработанноеВремяПоДням.День29,
		|	ТабельОтработанноеВремяПоДням.День30,
		|	ТабельОтработанноеВремяПоДням.День31
		|ИЗ
		|	Документ.ТабельУчетаРабочегоВремени.ДниРаботы КАК ТабельОтработанноеВремяПоДням
		|ГДЕ
		|	ТабельОтработанноеВремяПоДням.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТабельОтработанноеВремяПоДням.НомерСтроки";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		НПП = 0;
		Пока Выборка.Следующий() Цикл
			
			ЧасыПерваяПоловина = 0;
			ДниПерваяПоловина  = 0;
			ЧасыВтораяПоловина = 0;
			ДниВтораяПоловина  = 0;
			
			НПП = НПП + 1;				
			ОбластьДетали.Параметры.НомерПП = НПП;
			ОбластьДетали.Параметры.Заполнить(Выборка);
			Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
				ФИО = ФормированиеПечатныхФорм.ПолучитьФамилиюИмяОтчество(Выборка.Сотрудник.Фамилия, Выборка.Сотрудник.Имя, Выборка.Сотрудник.Отчество,Истина);
			Иначе
				ФИО = "";
			КонецЕсли;
			
			ОбластьДетали.Параметры.НаименованиеСотрудник = ?(ЗначениеЗаполнено(ФИО), ФИО, Выборка.Сотрудник);
			ОбластьДетали.Параметры.Должность             = Строка(Выборка.Сотрудник.Должность);
			
			Для Счетчик = 1 По 15 Цикл
				
				СтрокаЧасы = Выборка["День" + Счетчик];								 		 
				ОбластьДетали.Параметры["ДополнительноеЗначение" + Счетчик] = СтрокаЧасы;
				ЧасыПерваяПоловина = ЧасыПерваяПоловина + (Цел(СтрокаЧасы)*60 + (СтрокаЧасы - Цел(СтрокаЧасы))*60);
				
				ДниПерваяПоловина  = ДниПерваяПоловина + ?(СтрокаЧасы > 0, 1, 0);
				
			КонецЦикла; 
			
			Для Счетчик = 16 По День(КонецМесяца(ТекущийДокумент.Период)) Цикл
				
				СтрокаЧасы = Выборка["День" + Счетчик];							 		 
				ОбластьДетали.Параметры["ДополнительноеЗначение" + Счетчик] = СтрокаЧасы;			 							 
				// ЧасыВтораяПоловина = ЧасыВтораяПоловина +  СтрокаЧасы;
				ЧасыВтораяПоловина = ЧасыВтораяПоловина + (Цел(СтрокаЧасы)*60 + (СтрокаЧасы - Цел(СтрокаЧасы))*60);
				ДниВтораяПоловина  = ДниВтораяПоловина + ?(СтрокаЧасы > 0, 1, 0);
				
			КонецЦикла; 
			
			Для Счетчик = День(КонецМесяца(ТекущийДокумент.Период)) + 1 По 31 Цикл
				
				ОбластьДетали.Параметры["Символ" + Счетчик] = "Х";			 
				ОбластьДетали.Параметры["ДополнительноеЗначение" + Счетчик] = "Х";
				
			КонецЦикла; 
			
			ОбластьДетали.Параметры.ЧасыПерваяПоловина = Цел(ЧасыПерваяПоловина/60) + (ЧасыПерваяПоловина - Цел(ЧасыПерваяПоловина/60)*60)/60;
			// ОбластьДетали.Параметры.ЧасыПерваяПоловина = ЧасыПерваяПоловина;
			ОбластьДетали.Параметры.ДниПерваяПоловина  = ДниПерваяПоловина;
			// ОбластьДетали.Параметры.ЧасыВтораяПоловина = ЧасыВтораяПоловина;
			ОбластьДетали.Параметры.ЧасыВтораяПоловина = Цел(ЧасыВтораяПоловина/60) + (ЧасыВтораяПоловина - Цел(ЧасыВтораяПоловина/60)*60)/60;
			ОбластьДетали.Параметры.ДниВтораяПоловина  = ДниВтораяПоловина;
			ОбластьДетали.Параметры.ДниЗаМесяц         = ДниПерваяПоловина  + ДниВтораяПоловина;
			ОбластьДетали.Параметры.ЧасыЗаМесяц        = Цел((ЧасыПерваяПоловина+ЧасыВтораяПоловина)/60) 
															+ ((ЧасыПерваяПоловина+ЧасыВтораяПоловина) - Цел((ЧасыПерваяПоловина+ЧасыВтораяПоловина)/60)*60)/60;
			
			ТабличныйДокумент.Вывести(ОбластьДетали);
			
		КонецЦикла;
				
		ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьПодвала.Параметры.ФИОРуководителя       = ФормированиеПечатныхФорм.ПредставлениеОтветственногоЛица(Перечисления.ТипыОтветственныхЛиц.Руководитель,Шапка.Организация,Шапка.ДатаДокумента);
		ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера = ФормированиеПечатныхФорм.ПредставлениеОтветственногоЛица(Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер,Шапка.Организация,Шапка.ДатаДокумента);
		
		ОбластьПодвала.Параметры.РуководительДолжность = ФормированиеПечатныхФорм.ПредставлениеДолжностиОтветственногоЛица(Перечисления.ТипыОтветственныхЛиц.Руководитель,Шапка.Организация,Шапка.ДатаДокумента);
		ОбластьПодвала.Параметры.ГлБухДолжность        = ФормированиеПечатныхФорм.ПредставлениеДолжностиОтветственногоЛица(Перечисления.ТипыОтветственныхЛиц.ГлавныйБухгалтер,Шапка.Организация,Шапка.ДатаДокумента);
		
		ТабличныйДокумент.Вывести(ОбластьПодвала);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Табель") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Табель",
			"Табель учета рабочего времени",            
			ПечатнаяФорма(МассивОбъектов, ОбъектыПечати)
		);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("Табель", "Табель учета рабочего времени", , БиблиотекаКартинок.Документ);
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#КонецЕсли
